function AdCalenda2ThaiCalendar(AD_date){
// Project: AdCalenda2ThaiCalendar
// Licese: Open source and licensed under MIT license.
// Language: Google Apps Script (JavaScript)
// Author: Apichai Jantarmas (apichaij2@gmail.com)
// Version: 1.0
// Date: 18-October-2025
// Descriptions: Translate date from Anno Domini (A.D.) to Thai Calendar date.
//
// ตารางข้อมูล ของวันที่ ๑ มกราคม ระหว่าง พ.ศ. ๒๔๐๐ - ๒๖๙๙ (ค.ศ. 1857 - 2156)
// ตัวเลขข้อมูล แบ่งย่อย เป็น 3 ชุด (AB) (C) (D)
// (AB) : ข้างขึ้น (1-15) + ข้างแรม (16-29)
//
// ตัวอย่าง  624  : AB=6  , C=2 , D=4 : ชึ้น 6 ค่ำ เดือน ยี่ , (อธิก-ปฏิทิน)=4 : จันทรคติไทย - ปกติมาส
// ตัวอย่าง 1720  : AB=17 (17-15=2) , C=2 , D=0 : แรม 2 ค่ำ เดือน ยี่ , (อธิก-ปฏิทิน)=0 : จันทรคติไทย - ปกติมาส
//
//  ข้อมูล C คือ เดือนไทย เดือนไทย ของวันที่ ๑ มกราคม
//// (C)  : เดือนไทย 1 เดือน อ้าย , เดือนไทย 2 เดือน ยี่
//
// อธิกสุรทิน	อธิกมาส	อธิกวาร ข้อมูล (D) แยกเป็น bit ในเลขฐาน 2
// จันทรคติไทย - ปกติมาส (354) , จันทรคติไทย - อธิกวาร (355) , จันทรคติไทย - อธิกมาส (384)
// อธิกสุรทิน	 อธิกมาส(384)	อธิกวาร(355) 
//    0         0           0         =  0     จันทรคติไทย - ปกติมาส  , สุริยคติ - ปกติสุรทิน (365)
//    0         0           1         =  1     จันทรคติไทย - อธิกวาร  , สุริยคติ - ปกติสุรทิน (365)
//    0         1           0         =  2     จันทรคติไทย - อธิกมาส  , สุริยคติ - ปกติสุรทิน (365)
//    0         1           1         =  3     -- ไม่มีใน ปฏิทินไทย--                 
//    1         0           0         =  4     จันทรคติไทย - ปกติมาส  , สุริยคติ - อธิกสุรทิน (366)
//    1         0           1         =  5     จันทรคติไทย - อธิกวาร  , สุริยคติ - อธิกสุรทิน (366)
//    1         1           0         =  6     จันทรคติไทย - อธิกมาส  , สุริยคติ - อธิกสุรทิน (366)
    const Year_info = [
    624, 1720, 2712, 920, 2025, 122, 1220, 2212, 524, 1521,
    2512, 720, 1924, 2912, 1120, 2121, 326, 1420, 2412, 620,
    1725, 2712, 920, 2020, 226, 1221, 2212, 420, 1624, 2612,
    820, 1821, 2916, 1120, 2112, 320, 1425, 2412, 620, 1720,
    2816, 1020, 2021, 122, 1220, 2212, 420, 1421, 2516, 720,
    1820, 2816, 1021, 2012, 220, 1324, 2412, 620, 1621, 2616,
    920, 1921, 2912, 1124, 2212, 420, 1520, 2516, 820, 1821,
    2812, 1024, 2112, 221, 1320, 2316, 620, 1621, 2612, 824,
    1921, 2912, 1120, 2116, 420, 1522, 2510, 726, 1811, 2810,
    1022, 2014, 321, 1322, 2310, 525, 1622, 2610, 820, 1926,
    121, 1122, 2110, 324, 1522, 2510, 721, 1726, 2810, 1022,
    2010, 224, 1422, 2411, 520, 1626, 2711, 820, 1922, 2914,
    1222, 2210, 421, 1426, 2510, 720, 1822, 2814, 1122, 2110,
    321, 1326, 2410, 621, 1622, 2614, 922, 1910, 120, 1226,
    2311, 420, 1522, 2515, 720, 1822, 2810, 1026, 2110, 321,
    1322, 2314, 621, 1622, 2610, 826, 1910, 120, 1222, 2215,
    420, 1522, 2510, 725, 1822, 2810, 1022, 2014, 321, 1322,
    2310, 524, 1722, 2710, 922, 1915, 120, 1222, 2211, 324,
    1522, 2510, 720, 1826, 2911, 1020, 2122, 224, 1422, 2411,
    520, 1626, 2710, 922, 1910, 125, 1222, 2210, 421, 1426,
    2510, 721, 1722, 2714, 1020, 2122, 220, 1326, 2410, 622,
    1611, 2614, 922, 1910, 121, 1126, 2210, 422, 1410, 2515,
    722, 1710, 2810, 1026, 2110, 322, 1311, 2314, 622, 1611,
    2610, 826, 1910, 120, 1222, 2215, 420, 1522, 2510, 726,
    1811, 2810, 1022, 2010, 222, 1210, 2311, 426, 1510, 2610,
    822, 1814, 121, 1120, 2221, 236, 1420, 2522, 620, 1726,
    2811, 920, 2022, 124, 1321, 2322, 420, 1526, 2610, 821,
    1822, 2814, 1120, 2222, 320, 1426, 2511, 620, 1722, 2715,
    920, 2022, 120, 1224, 2422, 521, 1520, 2626, 820, 1922,
    2911, 1024, 2222, 320, 1422, 2414, 721, 1722, 2710, 924];
// ตารางข้อมูล บอกถึงจำนวนวันในแต่ละเดือน ของ ปีไทย สุริยคติ และ ปจันทรคติไทย
    const Year_info_Sun_0 = [365, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];  // สุริยคติ - ปกติสุรทิน (365)
    const Year_info_Sun_1 = [366, 31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];  // สุริยคติ - อธิกสุรทิน (366)
    
    const Year_info_Moon_0 = [354, 29, 30, 29, 30, 29, 30, 29, 30,  0, 29, 30, 29, 30, 29, 30, 29, 30, 29]; // จันทรคติไทย - ปกติมาส (354)
    const Year_info_Moon_1 = [355, 29, 30, 29, 30, 29, 30, 30, 30,  0, 29, 30, 29, 30, 29, 30, 29, 30, 29]; // จันทรคติไทย - อธิกวาร (355)
    const Year_info_Moon_2 = [384, 29, 30, 29, 30, 29, 30, 29, 30, 30, 29, 30, 29, 30, 29, 30, 29, 30, 29]; // จันทรคติไทย - อธิกมาส (384)
    
    const asterism_year_info=["กุน","ชวด","ฉลู","ขาล","เถาะ","มะโรง","มะเส็ง","มะเมีย","มะแม","วอก","ระกา","จอ"];
    const thai_week_info=["อาทิตย์","จันทร์","อังคาร","พุธ","พฤหัสบดี","ศุกร์","เสาร์"];
    const thai_month_info=["มกราคม","กุมภาพันธ์","มีนาคม","เมษายน","พฤษภาคม","มิถุนายน","กรกฎาคม","สิงหาคม","กันยายน","ตุลาคม","พฤศจิกายน","ธันวาคม"];
    const thai_month_moon_info=["Error","เดือนอ้าย(1)","เดือนยี่(2)","เดือนสาม(3)","เดือนสี่(4)","เดือนห้า(5)","เดือนหก(6)","เดือนเจ็ด(7)",
        "เดือนแปด(8)","เดือนแปดหลัง(88)","เดือนเก้า(9)","เดือนสิบ(10)","เดือนสิบเอ็ด(11)","เดือนสิบสอง(12)"];  
    
    const millisecondsPerDay = 24 * 60 * 60 * 1000; // Milliseconds in one day

// คำนวณหา ชนิด ของ ปี สุริยคติ จันทรคติไทย  ( วันที่ ๑ มกราคม )
    var AD_year = AD_date.getFullYear();  // ปีที่ต้องทราบ
    var Date_new_year = new Date(AD_year, 0, 1, 0, 0, 0);   // วันที่ 1 มกราคม พ.ศ. คริสต์ศักราช xxxx
    
// ตรวจสอบ ข้อมูล ที่จะคำนวณ ระหว่าง พ.ศ. ๒๔๐๐ - ๒๖๙๙ (ค.ศ. 1857 - 2156)
    if ( AD_year < 1857 || AD_year > 2156 ) { 
        return -1;   // out-of-range 
    } 
    
//------- Look up ข้อมูล จากตาราง Year_info -----
// Decode :  k_1st_month (เดือน) , k_1st_moon_phases (ข้างแรม) ของ วันที่ 1 มกราคม
// ตัวเลขข้อมูล แบ่งย่อย เป็น 3 ชุด (AB) (C) (D)
// (AB) : ข้างขึ้น (1-15) + ข้างแรม (16-29)
    var i_Year_info =  Year_info[AD_year-1857];   // Lookup data
    x = i_Year_info;
    y = parseInt(x/100)*100;
    k_1st_month = parseInt((x - y)/10);
    k_1st_moon_phases = parseInt(x/100);
    k_lunar_system = x % 10;
    
// หา วันที่ วัน เดือน ปี
    s_date = String(AD_date.getDate());     // วันที่ 1-31
    s_day = thai_week_info[AD_date.getDay()];     // วัน "อาทิตย์","จันทร์","อังคาร"
    s_month = thai_month_info[AD_date.getMonth()];     // เดือน "มกราคม","กุมภาพันธ์","มีนาคม"
    s_year = String(AD_year+543);     // FullYear
    t_date = "วัน" + s_day + "ที่ " + s_date + " เดือน" + s_month + " พ.ศ. " + s_year;
    
// Decode :  k_lunar_system ( หาว่าปีนั้น เป็นปีอะไร "อธิกสุรทิน	อธิกมาส	อธิกวาร" )
//  หา เดือน ใน จันทรคติไทย
    mas1 = k_lunar_system;
    if ( mas1 == 0 || mas1 == 4  ) {    //  ปกติมาส
        Year_info_Moon = Year_info_Moon_0;
    } else if ( mas1 == 1 || mas1 == 5  ) {  // set อธิกวาร
        Year_info_Moon = Year_info_Moon_1;
    } else if ( mas1 == 2 || mas1 == 6  ) {  // set อธิกมาส
        Year_info_Moon = Year_info_Moon_2;
    } else {
        return -2;    // data error
    }
    
// คำนวนหา "วันแรกของปีไทย" ( ขึ้น 1 ค่ำ เดือน อ้าย ) คำนวณจากค่าของ วันที่ 1 มกราคม
// calculate find end of thai year  start from 1 january xxxx
    moon1 =  k_1st_moon_phases;  // ข้างขึ้น-ข้างแรม
    month1 = k_1st_month; // เดือน

// จำนวนวันในหนึ่งปีของ จันทรคติไทย - ( จำนวนวัน จาก ข้างขึ้น ข้างแรม ของ วันที่ 1 ม.ค.)
    if ( month1 == 1 ) {
        date_TH_end = Year_info_Moon[0] - moon1 ;     // หาก  1 ม.ค.เป็น เดือนอ้าย ใช้เฉพาะ ข้างขึ้นข้างแรม
    } else {
        date_TH_end = Year_info_Moon[0] - ( moon1 + Year_info_Moon[1]  );  // หาก 1 ม.ค.เป็น เดือนยี่ ต้องเพิ่มจำนวนวันของเดือนอ้ายเข้าไปด้วย
    }

// คำนวณ ระห่าง จากวันที่ ต้องหาทราบ กับ วันเริ่มต้นปีไทย คือ ขึ้น 1 ค่ำ เดือนอ้าย
// คำนวณหา เดือนไทย และ ข้างขึ้น/ข้างแรม 
//  1. หาวันที่ ขึ้น ๑ ค่ำ เดือน อ้าย
//  2. หา ระยะห่าง ถึง ขึ้น ๑ ค่ำ เดือน อ้าย
// 3. คำนวณ จากหา เดือนไทย และ ข้างขึ้นข้างแรม จาก Year_info_Moon
// k_date_TH คือ ระยะห่างจาก วันที่ 1 ม.ค. กับ วันเริ่มต้นปีไทย คือ ขึ้น 1 ค่ำ เดือน
    moon1 =  k_1st_moon_phases;  // ข้างขึ้น-ข้างแรม ของวันที่ 1 ม.ค.
    month1 = k_1st_month; // วันที่ 1 ม.ค เป็น เดือนอ้าย หรือ เดือนยี่
    if ( month1 == 1 ) {      // ถ้าเป็นเดือน อ้าย
        k_date_TH = moon1 ;
    } else {
        k_date_TH = moon1 + Year_info_Moon[1];  // หาก ไม่ใช่ เดือนอ้าน แสดงว่าเป็นเดือนยี่ ให้ รวมจำนวนวันของเดือนอ้ายไปด้วย
    }
    const k_date_TH_start = new Date(Date_new_year.getTime() - (k_date_TH * millisecondsPerDay ))  // วันที่ ของ วันเริ่มต้นปีไทย คือ ขึ้น 1 ค่ำ เดือนอ้าย
    Distant_D_date  = ( AD_date -  k_date_TH_start)/millisecondsPerDay;  // ระยะห่างของ [ต้องการทราบ] กับ วันเริ่มต้นปีไทย คือ ขึ้น 1 ค่ำ เดือนอ้าย
    i_moon_phases =  parseInt(Distant_D_date);
    
// iTHmonth = เดือนไทย ,  i_moon_phases = จำนวนวัน(ข้างขึ้น/ข้างแรม)
    for ( iTHmonth = 1 ; iTHmonth <= 18 ; iTHmonth++ ) {
        if ( i_moon_phases <= Year_info_Moon[iTHmonth]) {
            break; // Terminate the loop
        } else {
            i_moon_phases =  i_moon_phases - Year_info_Moon[iTHmonth]; 
        }
    }
    
// ข้างขึ้น ข้างแรม
    if (i_moon_phases > 15 ) {
        i_moon_phases = i_moon_phases-15;
        moon_phases = " แรม " + String(i_moon_phases) + " ค่ำ";
    } else {
        moon_phases = " ขึ้น " + String(i_moon_phases) + " ค่ำ";
    }
    
// คำนวนปี นักษัตร ทั้ง12 ได้แก่ 1=ชวด ฉลู ขาล เถาะ มะโรง มะเส็ง มะเมีย มะแม วอก 10:ระกา 11:จอ 0:กุน
// ปี นักษัตร เริ่มที่ ขึ้น ๑ ค่ำเดือน ๕
    if ( iTHmonth < 5 ) {   // น้อยกว่า เดือน 5
        asterism_year = (AD_year-4)%12;       // Adjust 5:ชวด -> 1ชวด 
    } else {
        asterism_year = (AD_year-3)%12;       // หากเลย แรม 14 ค่ำเดือน ๔ นับเป็น ปีใหม่ นักษัตร
    }
    asterism = asterism_year_info[asterism_year];
    
// เดือนไทย
    if ( iTHmonth > 13 ) {      // หากเกิน 13 เดือน ( รวมเดือน 8 สองหน ) นับเป็น เดือนอ้าย ยี่... ของปีถัดไป (ปีไืทย)
        iTHmonth = iTHmonth - 13;
    }
    thai_month_moon = thai_month_moon_info[iTHmonth];
    thai_date = t_date + moon_phases + " " + thai_month_moon + " ปี" + asterism;

// แปลง เลขอารบิค เป็น เลขไทย 1->๑ 2->๒ .... 0->๐
    thai_date = thai_date.replace(/0/gi,'๐');
    thai_date = thai_date.replace(/1/gi,'๑');
    thai_date = thai_date.replace(/2/gi,'๒');
    thai_date = thai_date.replace(/3/gi,'๓');
    thai_date = thai_date.replace(/4/gi,'๔');
    thai_date = thai_date.replace(/5/gi,'๕');
    thai_date = thai_date.replace(/6/gi,'๖');
    thai_date = thai_date.replace(/7/gi,'๗');
    thai_date = thai_date.replace(/8/gi,'๘');
    thai_date = thai_date.replace(/9/gi,'๙');
// Return Thai Date :( Example "วันพุธที่ ๒๔ เดือนกรกฎาคม พ.ศ. ๒๕๔๕ ขึ้น ๑๕ ค่ำ เดือนแปดหลัง(๘๘) ปีมะเมีย")
    return thai_date;
}